#+title: Example usage

#+property: header-args:python :session *lovett-docs* :results raw :wrap result

* Loaders

The first task of an analyst is to load corpus data into Lovett.
Loaders are provided for this purpose in the =lovett.loaders= module for this purpose.
*************** TODO loaders (pl) or loader (sg)?                  :noexport:
*************** END
There are presently two kinds of loader:

- =FileLoader= :: This class implements loading from files on disk.  It will be the most commonly used loader
- =GithubLoader= :: This class implements loading corpus files from a repository hosted on github.
  It can be used to quickly disseminate code for an analysis of public data to a large group (for example students in a class) without requiring that they individually download the data.

The =loaders= module also provides loaders for the following publicly available corpora:

- [[http://www.linguist.is/icelandic_treebank/Icelandic_Parsed_Historical_Corpus_(IcePaHC)][IcePaHC]]

*************** TODO get permission for mbe text from Tony         :noexport:
*************** END

For this example, we’ll create a loader which targets a single file which hosted in the Lovett source code repository specifically to serve as an example.
This file is a parsed version of TODO.
(NB: You will need internet access in order to run the code in this section successfully.)
*************** TODO get this working                              :noexport:
*************** END


(Actually while I’m still getting this set up, I’ve used IcePaHC instead.)

#+begin_src python :exports code
import lovett.loader
my_loader = lovett.loader.GithubLoader(user="antonkarl",
                                       repo="icecorpus",
                                       directory="finished/")
#+end_src

#+RESULTS:

We can find out which files are contained in this corpus:

#+begin_src python :exports both :results raw :wrap result
my_loader.files()[0:5]
#+end_src

#+RESULTS:
#+BEGIN_result
['1150.firstgrammar.sci-lin.psd', '1150.homiliubok.rel-ser.psd', '1210.jartein.rel-sag.psd', '1210.thorlakur.rel-sag.psd', '1250.sturlunga.nar-sag.psd']
#+END_result

We can also get the contents of a file by name:[fn:1b3625ef]

#+begin_src python :exports both
my_loader.file("1150.firstgrammar.sci-lin.psd")[0:100]
#+end_src

#+RESULTS:
#+BEGIN_result

( (IP-MAT (PP (P Í-í)
	      (NP (QS-D flestum-margur) (NS-D löndum-land)))
	  (VBPI setja-setja)

#+END_result

# ) )

[fn:1b3625ef] Here we are displaying just the first 100 characters of the file, to avoid cluttering the document with a very long output.


The final functionality which a loader provides is to transform the files it accesses into a =Corpus= object.
By default, all available files will be included.
If you want a =Corpus= containing trees from just a single file, or set of files, you can pass a string or list to the =corpus= function.

*************** TODO use the ipython backend here to get nice html results :noexport:
*************** END

#+begin_src python
my_corpus = my_loader.corpus()
#+end_src

#+RESULTS:

Details about the file formats that Lovett understands will be presented elsewhere in the documentation.
*************** TODO link                                          :noexport:
*************** END

